src/Catalogs/ОСМИ_ШаблоныЭлектронныхКарт/ОСМИ_ШаблоныЭлектронныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ШаблоныЭлектронныхКарт</name>
  <attributes>
    <name>СодержимоеБаркода</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоБаркода</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьБаркод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеПодписи</name>
    <type>
      <types>EnumRef.ОСМИ_СодержимоеБаркодаПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияСодержимогоПодписи</name>
    <type>
      <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестОповещенияПриОтправкеКартыПоSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестОповещенияПриОтправкеКартыПоЭлектроннойПочте</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляШаблона</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>46</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПолучения</name>
      <type>
        <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОповещения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьПУШ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОСМИ_ШаблоныЭлектронныхКарт/ObjectModule.bsl
Процедура ОбновитьССервера() Экспорт
	ДанныеШаблона = ОСМИ_РаботаСAPI.ЗапроситьИнформациюОШаблоне(Наименование);
	Если ДанныеШаблона.Успех тогда
		МассивПолей = ДанныеШаблона.Ответ.values;
		ПоляШаблона.Очистить();
		Для Каждого Поле Из МассивПолей Цикл
			Стр = ПоляШаблона.Добавить();
			Стр.Имя = Поле.Label;
			Стр.ОтправлятьПУШ = Истина;
			Стр.ТекстОповещения = Поле.changeMsg;
			Если СтрДлина(СокрЛП(Поле.value)) > 0 Тогда
				Стр.СпособПолучения =  Поле.value;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
